## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["cluster-api.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = false
      + ciuser                 = "suporte"
      + clone                  = "ubuntu24-template"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.17/24,gw=192.168.1.1,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "cluster-api"
      + nameserver             = "192.168.1.3"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9"
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide1 {
                  + cloudinit {
                      + storage = "data2"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "30G"
                      + storage              = "data2"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  